# PANDAS

## DAY 5

* AGENDA
1. visualization
2.DataFrame to json file
3. DataFrame to csv file

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [6]:
data={'id':['1','2','3','4','5','6','7','8'],
      'name':['rachit','mansi','riddhi','isha','ishan','rehan','ruhan','rashi'],
      'age':['19','19','34','16','13','15','17','19',]
          }

In [7]:
d1=pd.DataFrame(data)

In [8]:
d1

  id    name age
0  1  rachit  19
1  2   mansi  19
2  3  riddhi  34
3  4    isha  16
4  5   ishan  13
5  6   rehan  15
6  7   ruhan  17
7  8   rashi  19

In [11]:
d1.to_json('myjsonfile.json')   #the file looks like a nested dictionary

In [27]:
d2=pd.read_json('myjsonfile.json') #this command will read the json file

In [13]:
d2

   id    name  age
0   1  rachit   19
1   2   mansi   19
2   3  riddhi   34
3   4    isha   16
4   5   ishan   13
5   6   rehan   15
6   7   ruhan   17
7   8   rashi   19

In [25]:
d1.to_csv('mycsvfile1.csv') #this command will convert the dataframe 1 to a csv file

In [26]:
d3=pd.read_csv('mycsvfile1.csv')  #this command will read the csv file

In [17]:
d3

   Unnamed: 0  id    name  age
0           0   1  rachit   19
1           1   2   mansi   19
2           2   3  riddhi   34
3           3   4    isha   16
4           4   5   ishan   13
5           5   6   rehan   15
6           6   7   ruhan   17
7           7   8   rashi   19

In [24]:
d1.to_html('myhtmlfile.html') #this command will convert the dataframe 1 to a html file

In [23]:
d3=pd.read_html('myhtmlfile.html') #this command will read the html file

In [22]:
d3

[   Unnamed: 0  id    name  age
 0           0   1  rachit   19
 1           1   2   mansi   19
 2           2   3  riddhi   34
 3           3   4    isha   16
 4           4   5   ishan   13
 5           5   6   rehan   15
 6           6   7   ruhan   17
 7           7   8   rashi   19]

## LINSPACE

In [33]:
a= np.linspace(1,10,5) # gives  5 evenly spaced values from 1 to 10 # spaces between the values are also similar

In [34]:
a

array([ 1.  ,  3.25,  5.5 ,  7.75, 10.  ])

In [38]:
b= np.linspace(1,10,10) #distance between the values are same

In [39]:
b

array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10.])

# VISUALIZATION

 THE DATA CAN BE UNDERSTOOD EASILY USING VISUALIZATION

DATA PATTERN CAN ALSO BE UNDERSTOOD USING VISUALIZATION

## libraries used for visualization
## 1. Pandas-> Basic Visualization
## 2. Matplotlib
## 3. SeaBorn->give extra look to graph
## 4. Plotly->advanced visualization library of python

1. LINE GRAPH
2. BAR GRAPH
3. PYCHART
4. HISTOGRAM
5. PAIR PLOT
6. STRIP PLOT
7. COUNT PLOT
8. BOX PLOT
9. VIOLIN PLOT
10. KDE PLOT
11. SWARM PLOT
12. AREA GRAPH
13. SCATTER PLOT